In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(pd.read_csv("./data/raw_data.csv"))
copy = df.copy()

In [10]:
copy = copy.drop_duplicates()
mean_age = copy["age"].mean()
mean_income = copy["income"].mean()
copy["age"] = copy["age"].fillna(mean_age)
copy["income"] = copy["income"].fillna(mean_income)
new_data = copy.dropna()

In [11]:
new_data

   id          name        age country   gender        income
0   1      John Doe  29.000000     USA     Male  55000.000000
2   2    Jane Smith  33.285714  Canada   Female  62000.000000
3   3          Alex  33.285714     USA  Unknown  47000.000000
4   4  Maria Garcia  34.000000   Spain   Female  57888.888889
5   5        Li Wei  27.000000   China     Male  51000.000000
8   8    Rachel Lee  29.000000     USA   Female  62000.000000
9   9   Carlos Ruiz  33.285714  Mexico     Male  45000.000000

In [13]:
new_data.to_csv("./data/new_data.csv")